X_WS_SOAP_Java/wsdl/wsgen/RPCLiteralService/RPCLiteralServiceSEI.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.6 in JDK 6. -->
<definitions targetNamespace="http://literal.rpc.binding.ws.pg.com/" name="RPCLiteralServiceSEI" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://literal.rpc.binding.ws.pg.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://literal.rpc.binding.ws.pg.com/" schemaLocation="RPCLiteralServiceSEI_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="getExchangeRate">
    <part name="arg0" type="tns:exchangeRateRequestBO"/>
    <part name="arg1" type="xsd:string"/>
  </message>
  <message name="getExchangeRateResponse">
    <part name="return" type="tns:exchangeRateBO"/>
  </message>
  <portType name="RPCLiteralService">
    <operation name="getExchangeRate" parameterOrder="arg0 arg1">
      <input message="tns:getExchangeRate"/>
      <output message="tns:getExchangeRateResponse"/>
    </operation>
  </portType>
  <binding name="RPCLiteralServiceImplPortBinding" type="tns:RPCLiteralService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"/>
    <operation name="getExchangeRate">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal" namespace="http://literal.rpc.binding.ws.pg.com/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://literal.rpc.binding.ws.pg.com/"/>
      </output>
    </operation>
  </binding>
  <service name="RPCLiteralServiceSEI">
    <port name="RPCLiteralServiceImplPort" binding="tns:RPCLiteralServiceImplPortBinding">
      <soap:address location="REPLACE_WITH_ACTUAL_URL"/>
    </port>
  </service>
</definitions>

